tap "cloudflare/cloudflare"
tap "homebrew/cask-fonts"
tap "microsoft/mssql-release"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Extremely Fast Compression algorithm
brew "lz4"
# TIFF library and utilities
brew "libtiff"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# B2 Cloud Storage Command-Line Tools
brew "b2-tools"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Platform built on V8 to build network applications
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Emacs text editor
brew "emacs"
# Emacs dependency management
brew "cask"
# Generic library support script
brew "libtool"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Command-line fuzzy finder written in Go
brew "fzf"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Kubernetes package manager
brew "helm"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image processing and image analysis library
brew "leptonica"
# Terminal file manager
brew "lf"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# General purpose TCP-IP emulator
brew "libslirp"
# Utility for directing compilation
brew "make"
# Tools to facilitate the use of Microsoft Access databases
brew "mdbtools"
# Replacement for ls, cp and other commands for object storage
brew "minio-mc"
# SMTP client that can be used as an SMTP plugin for Mutt
brew "msmtp"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Python dependency management tool
brew "pipenv"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Persistent key-value database, with built-in net interface
brew "redis"
# User interface to the TELNET protocol
brew "telnet"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Executes a program periodically, showing output fullscreen
brew "watch"
# JavaScript package manager
brew "yarn"
# ODBC Driver for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/msodbcsql17"
# ODBC Driver for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/msodbcsql18"
# Sqlcmd and Bcp for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/mssql-tools"
# Sqlcmd and Bcp for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/mssql-tools18"
# Professional graphic design software
cask "affinity-designer"
# Professional image editing software
cask "affinity-photo"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Universal database tool and SQL client
cask "dbeaver-community"
cask "font-hack-nerd-font"
cask "font-inconsolata-for-powerline"
cask "font-inconsolata-nerd-font"
# Keyboard customiser
cask "karabiner-elements"
# Shows the next meeting in the menu bar
cask "meetingbar"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Command-line shell and scripting language
cask "powershell"
# Text editor for code, markup and prose
cask "sublime-text"
# Open-source code editor
cask "visual-studio-code"
vscode "bmewburn.vscode-intelephense-client"
vscode "budparr.language-hugo-vscode"
vscode "codingyu.laravel-goto-view"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "docker.docker"
vscode "donjayamanne.python-environment-manager"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "gitlab.gitlab-workflow"
vscode "iancooper.code-zpl"
vscode "jwillinghalpern.filemaker-vscode"
vscode "kamilturek.vscode-zpl-viewer"
vscode "kevinrose.vsc-python-indent"
vscode "magicstack.magicpython"
vscode "marlon407.code-groovy"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "njpwerner.autodocstring"
vscode "onecentlin.laravel-blade"
vscode "onecentlin.laravel5-snippets"
vscode "paulober.pico-w-go"
vscode "redhat.ansible"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ricardomfmsousa.chordpro"
vscode "rust-lang.rust-analyzer"
vscode "ryannaddy.laravel-artisan"
vscode "snyk-security.snyk-vulnerability-scanner"
vscode "sureshmadadha.nacha-viewer"
vscode "svelte.svelte-vscode"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "william-voyek.vscode-nginx"
